# DefaultProjectTemplate Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..DefaultProjectTemplate Property
Application Class See Also
---
Full path to the default template file for new project documents.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string DefaultProjectTemplate { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DefaultProjectTemplate As String
	Get
```

Visual C++
---
```text
public:
property String^ DefaultProjectTemplate {
	String^ get ();
}
```

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace